Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures.ModelWithNoConditionedSpacesWarn Property
 The model has no conditioned spaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ModelWithNoConditionedSpacesWarn { get; }
Visual Basic
Public Shared ReadOnly Property ModelWithNoConditionedSpacesWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ModelWithNoConditionedSpacesWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace